#ifndef _PLAYER_TITLE_H_
#define _PLAYER_TITLE_H_
//=============================================================================
//
//	タイトル	ヘッダファイル(player_title.cpp)
//	ファイル名	player_title.h
//	作成者		AT13A284_07 池田達哉
//	作成日		2016/12/09
//
//=============================================================================
#include "player.h"

//=============================================================================
//	マクロ定義
//=============================================================================
#define PLAYER_TITLE_SPEED	(15.0f)

//=============================================================================
//	構造体
//=============================================================================

//=============================================================================
//	クラス定義
//=============================================================================
class CPlayer_Title : public CPlayer
{
public:
	void	Init(D3DXVECTOR3 pos = VEC3_ZERO);
	void	Update(void);
	void	Draw(void);

	static CPlayer_Title* Create(bool ifListAdd = true, int priority = PRIORITY_2D, OBJTYPE objtype = OBJTYPE_NONE,
		D3DXVECTOR3 pos = VEC3_ZERO);

private:
	int m_Frame;
};

#endif